# CreateTaperedExtrude

## Description
Creates a new tapered extrude object in the document.

```pascal
FUNCTION CreateTaperedExtrude(
				profileH : HANDLE;
				angle    : REAL;
				height   : REAL): HANDLE;
```

```python
def vs.CreateTaperedExtrude(profileH, angle, height):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|profileH|HANDLE|Handle to object defining profile geometry.|
|angle|REAL|Taper angle of extrude (in degrees).|
|height|REAL|Height of extrude.|

## Remarks
*\_c\_*, (2016.02.10):  This always fails creating a number of NURBS instead of a tapered extrude. From VW 2016 you can use CreateTaperedExtrd2.

## Examples
```pascal
resultH := CreateTaperedExtrude(profileH, 1.0, 2.0);
```
```python
import vs

# Creates a new tapered extrude object in the document.
profileH = vs.FSActLayer()  # handle to the first selected object on the active layer
angle = 45.0
height = 2.0

objHandle = vs.CreateTaperedExtrude(profileH, angle, height)
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## Version
Availability: from VectorWorks 9.0

## Category
* Objects - 3D